#Задайте список из нескольких чисел. Напишите программу, которая найдёт сумму элементов списка,
#  стоящих на нечётной позиции.

#Пример:
#[2, 3, 5, 9, 3] -> на нечётных позициях элементы 3 и 9, ответ: 12

"""my_list = list(map(int, input('Введите числа:').split()))
print(sum(my_list[1::2]))"""


#Напишите программу, которая принимает на вход вещественное число и показывает сумму его цифр.

"""a = input('Введите вещественное число: ')
sum = sum(map(int, a.replace('.', '')))
print (sum)"""

# Дана последовательность чисел. 
# Получить список уникальных элементов заданной последовательности.

"""a=[1, 2, 4, 5, 1, 4, 5, 9, 8, 3]
numbers_list = a
result_list = list(filter(lambda x: numbers_list.count(x) == 1, numbers_list))
print('Cписок уникальных элементов => {}'.format( result_list))"""


#Напишите программу, которая принимает на вход число N и выдает набор произведений чисел от 1 до N.

from math import factorial
n = int(input('Введите число: '))
print(list(map(lambda x: ((x == 1) and  1) or x * factorial(x -1),list(range (1,n+1)))))